app/views/students/show.html.erb

<ul>
  <%@student.enrollments.each do |enrollment| %>
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ?  [["student_id", 1]]