app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require(:student).permit(:name,:age))
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dorji"], ["age", 21], ["created_at", "2023-07-05 17:12:27.506653"], ["updated_at", "2023-07-05 17:12:27.506653"]]

  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student).permit(:name,:age))
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "karma tenzin"], ["updated_at", "2023-07-05 17:33:06.926714"], ["id", 2]]